Revit 2027 API
SpacingRule.SetLayoutFixedDistance Method
Set the Layout property to FixedDistance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutFixedDistance(
	double distance,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
Public Sub SetLayoutFixedDistance (
	distance As Double,
	just As SpacingRuleJustification,
	gridlinesRotation As Double,
	offset As Double
)
public:
void SetLayoutFixedDistance(
	double distance,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
member SetLayoutFixedDistance :
        distance : float *
        just : SpacingRuleJustification *
        gridlinesRotation : float *
        offset : float -> unit
Parameters
distance Double
just SpacingRuleJustification
gridlinesRotation Double
offset Double
Remarks
When changing the Layout to FixedDistance, you must also simultaneously set the Distance, Justification, GridlinesRotation, and Offset properties.
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace